In [8]:
import numpy as np
import pandas as pd

In [11]:
labels = ['a','b','c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [16]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [20]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [23]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [30]:
ser2 = pd.Series(data = [1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [31]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [32]:
data = {
    "Name": ["Alice", "Bob"],
    "Age": [25, 30]
}

df = pd.DataFrame(data)
print(df)

    Name  Age
0  Alice   25
1    Bob   30

In [35]:
'A B C D E'.split() # split() turns string into an array

['A', 'B', 'C', 'D', 'E']

In [38]:
from numpy.random import randn

In [41]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [42]:
df

          W         X         Y         Z
A  0.754948  1.383007 -0.583494 -0.206557
B -0.221307 -0.924255 -0.552820  1.088777
C -0.552738  1.042145 -2.537231  0.464764
D -0.861387  0.772970 -0.598536 -0.629138
E -0.982428  2.059603  0.622693 -1.526475

In [43]:
df['W']

A    0.754948
B   -0.221307
C   -0.552738
D   -0.861387
E   -0.982428
Name: W, dtype: float64

In [44]:
df[['W','Z']]

          W         Z
A  0.754948 -0.206557
B -0.221307  1.088777
C -0.552738  0.464764
D -0.861387 -0.629138
E -0.982428 -1.526475

In [45]:
type(df['W'])

pandas.core.series.Series

In [60]:
df['new']=df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.754948  1.383007 -0.583494 -0.206557  0.171454
B -0.221307 -0.924255 -0.552820  1.088777 -0.774128
C -0.552738  1.042145 -2.537231  0.464764 -3.089969
D -0.861387  0.772970 -0.598536 -0.629138 -1.459923
E -0.982428  2.059603  0.622693 -1.526475 -0.359735

In [56]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.754948  1.383007 -0.583494 -0.206557
B -0.221307 -0.924255 -0.552820  1.088777
C -0.552738  1.042145 -2.537231  0.464764
D -0.861387  0.772970 -0.598536 -0.629138
E -0.982428  2.059603  0.622693 -1.526475

In [57]:
df # Because we did not assign it

          W         X         Y         Z       new
A  0.754948  1.383007 -0.583494 -0.206557  0.171454
B -0.221307 -0.924255 -0.552820  1.088777 -0.774128
C -0.552738  1.042145 -2.537231  0.464764 -3.089969
D -0.861387  0.772970 -0.598536 -0.629138 -1.459923
E -0.982428  2.059603  0.622693 -1.526475 -0.359735

In [61]:
df.drop('new',axis=1,inplace=True)

In [62]:
df

          W         X         Y         Z
A  0.754948  1.383007 -0.583494 -0.206557
B -0.221307 -0.924255 -0.552820  1.088777
C -0.552738  1.042145 -2.537231  0.464764
D -0.861387  0.772970 -0.598536 -0.629138
E -0.982428  2.059603  0.622693 -1.526475

In [63]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.754948  1.383007 -0.583494 -0.206557
B -0.221307 -0.924255 -0.552820  1.088777
C -0.552738  1.042145 -2.537231  0.464764
D -0.861387  0.772970 -0.598536 -0.629138

In [64]:
df.loc['A']

W    0.754948
X    1.383007
Y   -0.583494
Z   -0.206557
Name: A, dtype: float64

In [65]:
df.iloc[2]

W   -0.552738
X    1.042145
Y   -2.537231
Z    0.464764
Name: C, dtype: float64

In [67]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.754948 -0.583494
B -0.221307 -0.552820

In [69]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [70]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [72]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [79]:
data= pd.read_csv('./data_files/sample_data.csv')
data

   Age gender
0   32      F
1   14      F
2   72      M
3   37      F
4   21      M

In [80]:
data.head()

   Age gender
0   32      F
1   14      F
2   72      M
3   37      F
4   21      M

In [82]:
data.shape

(5, 2)

In [83]:
data.values

array([[32, 'F'],
       [14, 'F'],
       [72, 'M'],
       [37, 'F'],
       [21, 'M']], dtype=object)

In [87]:
data=pd.read_csv('./data_files/sample_data_no_header.csv')

In [88]:
data

   32  F
0  14  F
1  72  M
2  37  F
3  21  M

In [89]:
data.shape

(4, 2)

In [91]:
data=pd.read_csv('./data_files/sample_data_no_header.csv',header=None)
data

    0  1
0  32  F
1  14  F
2  72  M
3  37  F
4  21  M

In [96]:
data = pd.read_csv('./data_files/test.txt')
data

   17   M
0  23   F
1  12   M
2  24   M
3  56   F

In [98]:
data.to_csv('output_data.csv',header=False,index=None)